$(function() {

	// alert("Привет");

	// Даны величины размера 17, 19 и 25 дюймов. Переведите их в сантиметры (для этого достаточно умножить величину в дюймах на 2,54).

	// let sum1 = 17;
	// let sum2 = 17 * 2.54;   

	// let sum1a = 19;
	// let sum2a = 19 * 2.54;

	// let sum1b = 24;
	// let sum2b = 24 * 2.54;

	// console.log(sum1 , 'дюймов');
	
	// Проверьте, делится ли число 123456789 на 3 без остатка (подсказка: воспользуйтесь оператором взятия остатка от деления % и проверьте, равен ли получившийся остаток 0).

	// let s = 3 % 2;
	
	// console.log((s == 0) ? 'Число четное' : 'Число не четное');
	
	// Объявите переменную sum2 и присвойте ей сумму чисел 500, 600 и 700.

	// let sum2 = 500 + 600 + 700
	// console.log(sum2);

	// Объявите переменную count и присвойте ей число 3.

	// let count = 3
	// console.log(count);

	// Разделите значение переменной sum2 на значение переменной count. Получившееся частное присвойте константе average. В результате у вас получится среднее арифметическое чисел 500, 600 и 700.

	// sum2 / count 
    // const average = sum2 / count
	
	// Выведите полученное среднее арифметическое в консоли в формате: Среднее арифметическое: <значение>



	// Проверьте, были ли ранее объявлены переменные sum, count2 и specialvalue.

	// if (typeof sum === 'Переменная sum была ранее объявлена' ? 'Переменная sum не была ранее объявлена');

	// if (typeof count2 === 'Переменная sum была ранее объявлена' ? 'Переменная count2 не была ранее объявлена');

	// if (typeof specialvalue === 'Переменная sum была ранее объявлена' ? 'Переменная specialvalue не была ранее объявлена');

	// Вычислите квадратные корни от 2, 3, 4 и 7. Для этого воспользуйтесь следующей языковой конструкцией (подробности о ней — в уроке 4).

	// Math.sqrt(2)

	// Math.sqrt(3)

	// Math.sqrt(4)

	// Math.sqrt(7)

	// console.log(Math.sqrt(2));







	// Доработайте сценарий, переводящий величины из дюймов в сантиметры, таким образом, чтобы он выводил результат в двух абзацах: в первом— величину в дюймах, а во втором — в сантиметрах.

	// let sum1 = 17;
	// let sum2 = 17 * 2.54; 

	// let sum1a = 19;
	// let sum2a = 19 * 2.54;

	// let sum1b = 24;
	// let sum2b = 24 * 2.54;

	// console.log('Дюймы=', sum1, 'Сантиметры=', sum2);
});